<?php
header('Content-type: charset=utf-8');

require_once 'vendor/autoload.php';
$phpWord = new \PhpOffice\PhpWord\PhpWord();

$obj = array(
                                                        /*Фінальні документи*/
//---------------------------------------------------------------------------------------------------------------------------------------------------------                                                        
  "Бартер - Угода про зарахування під юр особу.docx",
  "Фінальні документи/Договір бронювання.docx",
  "Фінальні документи/Договір цесії - Ф.О. .docx",
  "Фінальні документи/Орієнтовний текст довіреності.docx",
  "Фінальні документи/Повідомлення про зміну банківських реквізитів.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Анулювання форварду*/

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу 2-сторонній.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Форварду.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Прямі договори/Фізична особа - ФОП*/  

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Інструкція по ФО-ФОПам.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Прямі договори/Юридична особа*/   

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/3. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/Інструкція по ЮО.docx",
  "Фінальні документи/Прямі договори/Юридична особа/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Через КУА/Фізична особа - ФОП*/

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/1. Комірка - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/2. Комірка - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/3. Комірка - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/4. Комірка - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/5. Комірка - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/6. Комірка - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/7. Комірка - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/8. Комірка - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/1. Квартира - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/2. Квартира - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/3. Квартира - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/4. Квартира - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/5. Квартира - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/6. Квартира - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/7. Квартира - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/8. Квартира - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/1. Комерція - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/2. Комерція - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/3. Комерція - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/4. Комерція - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/5. Комерція - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/6. Комерція - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/7. Комерція - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/8. Комерція - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/Інструкція по ФО-ФОПам.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Через КУА/Юридична особа*/ 

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/1. Комірка - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/2. Комірка - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/3. Комірка - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/4. Комірка - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/5. Комірка - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/6. Комірка - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/7. Комірка - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/8. Комірка - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/1. Квартира - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/2. Квартира - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/3. Квартира - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/4. Квартира - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/5. Квартира - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/6. Квартира - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/7. Квартира - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/8. Квартира - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/1. Комерція - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/2. Комерція - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/3. Комерція - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/4. Комерція - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/5. Комерція - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/6. Комерція - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/7. Комерція - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/8. Комерція - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/Інструкція по ЮО.docx",
  "Фінальні документи/Через КУА/Юридична особа/Опис справ - Додаток 1.docx"
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
);
for ($x = 0; $x < count($obj); $x++) {
    echo("<p>".$obj[$x]." </p>");
} 



/*$templateProcessor = new \PhpOffice\PhpWord\TemplateProcessor('yourdocument.docx');
$templateProcessor->setValue('Name', 'John Doe');
 
$templateProcessor->saveAs('yourdocument.docx');*/

/*$word = new COM("Word.Application") or die ("Could not initialise Object.");
  // set it to 1 to see the MS Word window (the actual opening of the document)
  $word->Visible = 1;
  // recommend to set to 0, disables alerts like "Do you want MS Word to be the default .. etc"
  $word->DisplayAlerts = 1;
  // open the word 2007-2013 document 
  $word->Documents->Open('yourdocument.docx');
  // save it as word 2003
  $word->ActiveDocument->SaveAs('newdocument.doc');
  // convert word 2007-2013 to PDF
  $word->ActiveDocument->ExportAsFixedFormat('yourdocument.pdf', 17, false, 0, 0, 0, 0, 7, true, true, 2, true, true, false);
  // quit the Word process
  $word->Quit(false);
  // clean up
  unset($word);*/

$filepath = '"' . getcwd() . '\\' . $obj[0] . '"';
/*echo($filepath);*/

$command = 'E:\Illia\program\soffice.exe -headless -convert-to pdf ' . $filepath .' -outdir "'. getcwd() . '"';
$command = mb_convert_encoding($command, 'cp1251');
echo($command);

exec($command);




/*//\PhpOffice\PhpWord\Settings::setPdfRendererPath('dompdf-0.6.2/next');
\PhpOffice\PhpWord\Settings::setPdfRendererName('AbstractRenderer');

$phpWord = \PhpOffice\PhpWord\IOFactory::load(mb_convert_encoding($obj[0], "CP1251")); 


$xmlWriter = \PhpOffice\PhpWord\IOFactory::createWriter($phpWord, 'PDF');


$xmlWriter->setFont('freesans');

$xmlWriter->save('result.pdf');*/

/*\PhpOffice\PhpWord\Settings::setPdfRendererPath('tcpdf_6_2_13\next');
\PhpOffice\PhpWord\Settings::setPdfRendererName('TCPDF');


$phpWord = \PhpOffice\PhpWord\IOFactory::load(mb_convert_encoding($obj[0], "CP1251")); 


//Save it

$xmlWriter = \PhpOffice\PhpWord\IOFactory::createWriter($phpword, 'PDF');
//$xmlWriter->setFont('freesans');

//TCPDF::SetFont('arialuni', '', 14, '', true);


$xmlWriter->save('result.pdf'); */ 

?>
<!DOCTYPE html>
<html>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<body>

<p>asddddddddddd</p>

</body>
</html>
