<!DOCTYPE html>
<html>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<body>
<?php
ignore_user_abort(false);
//---------------------------------------------------------------------------------------------------------------------------------------------------------
function createTreeStructure() {
  $structure = 'newDir/Фінальні документи/Анулювання форварду';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  
  $structure = 'newDir/Фінальні документи/Прямі договори\Фізична особа - ФОП\P - Комірка';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Прямі договори\Фізична особа - ФОП\А - Квартира';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Прямі договори/Фізична особа - ФОП\С - Комерція';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  
  $structure = 'newDir/Фінальні документи/Прямі договори\Юридична особа\P - Комірка';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Прямі договори\Юридична особа\А - Квартира';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Прямі договори/Юридична особа\С - Комерція';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  
  $structure = 'newDir/Фінальні документи/Через КУА\Фізична особа - ФОП\P - Комірка';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Через КУА\Фізична особа - ФОП\А - Квартира';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Через КУА/Фізична особа - ФОП\С - Комерція';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  
  $structure = 'newDir/Фінальні документи/Через КУА\Юридична особа\P - Комірка';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Через КУА\Юридична особа\А - Квартира';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
  $structure = 'newDir/Фінальні документи/Через КУА/Юридична особа\С - Комерція';
  mkdir(mb_convert_encoding($structure, 'cp1251'), 0777, true);
} 
//---------------------------------------------------------------------------------------------------------------------------------------------------------
function dirForConverter($str) {
  $lastOccurance = strrpos($str, "/");
  return substr($str, 0, $lastOccurance);
}
//---------------------------------------------------------------------------------------------------------------------------------------------------------


createTreeStructure();


require_once 'vendor/autoload.php';
$phpWord = new \PhpOffice\PhpWord\PhpWord();

//$result = json_decode('{"name": "John", "surname": "Doe", "tel": 1234567 }');
$obj = array(
  "Фінальні документи/Бартер - Угода про зарахування під юр особу.docx",
  "Фінальні документи/Договір бронювання.docx",
  "Фінальні документи/Договір цесії - Ф.О. .docx",
  "Фінальні документи/Орієнтовний текст довіреності.docx",
  "Фінальні документи/Повідомлення про зміну банківських реквізитів.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Анулювання форварду*/

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу 2-сторонній.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Форварду.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Прямі договори/Фізична особа - ФОП*/  

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Інструкція по ФО-ФОПам.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Прямі договори/Юридична особа*/   

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/3. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/Інструкція по ЮО.docx",
  "Фінальні документи/Прямі договори/Юридична особа/Опис справ - Додаток 1.docx"
  );

$obj1 = array(
                                                        /*Фінальні документи*/
//---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Бартер - Угода про зарахування під юр особу.docx",
  "Фінальні документи/Договір бронювання.docx",
  "Фінальні документи/Договір цесії - Ф.О. .docx",
  "Фінальні документи/Орієнтовний текст довіреності.docx",
  "Фінальні документи/Повідомлення про зміну банківських реквізитів.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Анулювання форварду*/

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу 2-сторонній.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Деривативу.docx",
  "Фінальні документи/Анулювання форварду/Анулювання Форварду.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                        /*Фінальні документи/Прямі договори/Фізична особа - ФОП*/  

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Інструкція по ФО-ФОПам.docx",
  "Фінальні документи/Прямі договори/Фізична особа - ФОП/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Прямі договори/Юридична особа*/   

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/1. Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/2. Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/P - Комірка/3. Комірка - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/1. Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/2. Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/А - Квартира/3. Квартира - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/1. Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/2. Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Прямі договори/Юридична особа/С - Комерція/3. Комерція - Платіжка за майнові.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Прямі договори/Юридична особа/Інструкція по ЮО.docx",
  "Фінальні документи/Прямі договори/Юридична особа/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Через КУА/Фізична особа - ФОП*/

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/1. Комірка - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/2. Комірка - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/3. Комірка - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/4. Комірка - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/5. Комірка - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/6. Комірка - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/7. Комірка - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/8. Комірка - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/1. Квартира - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/2. Квартира - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/3. Квартира - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/4. Квартира - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/5. Квартира - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/6. Квартира - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/7. Квартира - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/8. Квартира - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/1. Комерція - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/2. Комерція - Анкета ФО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/3. Комерція - Анкета ФО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/4. Комерція - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/5. Комерція - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/6. Комерція - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/7. Комерція - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/8. Комерція - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Фізична особа - ФОП/Інструкція по ФО-ФОПам.docx",
  "Фінальні документи/Через КУА/Фізична особа - ФОП/Опис справ - Додаток 1.docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------

                                                         /*Фінальні документи/Через КУА/Юридична особа*/ 

  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/1. Комірка - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/2. Комірка - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/3. Комірка - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/4. Комірка - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/5. Комірка - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/6. Комірка - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/7. Комірка - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/8. Комірка - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/1. Квартира - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/2. Квартира - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/3. Квартира - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/4. Квартира - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/5. Квартира - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/6. Квартира - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/7. Квартира - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/8. Квартира - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/1. Комерція - Заявка - внутрішня (Тікет).docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/2. Комерція - Анкета ЮО Біржа - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/3. Комерція - Анкета ЮО КУА - фінмоніторинг.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/4. Комерція - Заявка на участь у торгах.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/5. Комерція - Разове замовлення.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/6. Комерція - Заява на сміттєпровід.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/7. Комерція - Форвадний контракт.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/8. Комерція - Купівля деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
  "Фінальні документи/Через КУА/Юридична особа/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx",
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  "Фінальні документи/Через КУА/Юридична особа/Інструкція по ЮО.docx",
  "Фінальні документи/Через КУА/Юридична особа/Опис справ - Додаток 1.docx"
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
);
for ($x = 0; $x < count($obj); $x++) {


  $templateProcessor = new \PhpOffice\PhpWord\TemplateProcessor(mb_convert_encoding($obj[$x], 'cp1251'));
  $templateProcessor->setValue('Name', 'John Doe');
  $newPath = 'newDir\\' . mb_convert_encoding($obj[$x], 'cp1251');
  
  $templateProcessor->saveAs($newPath);
  //------------------------------------------------------------------------------------------------------------------------------------------------------------
  $filepath = '"' . getcwd() . '\\newDir\\' . $obj[$x] . '"';

  $command = 'E:\Illia\program\soffice.exe -headless -convert-to pdf ' . $filepath .' -outdir "'. getcwd() . '\\newDir\\'.dirForConverter($obj[$x]).'"';
  $command = mb_convert_encoding($command, 'cp1251');

  exec($command);

  echo (connection_aborted());
  if(connection_aborted() == 1) {
    
   // kill_the_process();//this will kill the running process launched by script
    die("No Error");
  }

}

$fp = fopen('data.txt', 'w');
    fwrite($fp, 'disconnect');
    fclose($fp);

echo exec('"C:\Program Files\WinRAR\Rar.exe" a -ep1 -r -m5 -df "e:\WordPress\OpenServer\modules\system\html\openserver\test\compress.rar" "E:\WordPress\OpenServer\modules\system\html\openserver\test\newDir\"');

//rmdir('newDir');

?>


<p>asddddddddddd</p>

</body>
</html>
