<?php
$obj = array(
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
                                                         /*Фінальні документи/Через КУА/Фізична особа - ФОП/розстрочка */
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(                                                       
    "Через КУА/Фізична особа - ФОП/P - Комірка/7. Комірка - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/8. Комірка - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Фізична особа - ФОП/А - Квартира/7. Квартира - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/8. Квартира - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Фізична особа - ФОП/С - Комерція/7. Комерція - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/8. Комерція - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
                                                        /*Фінальні документи/Через КУА/Юридична особа/розстрочка */
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Юридична особа/P - Комірка/7. Комірка - Форвадний контракт.docx",
    "Через КУА/Юридична особа/P - Комірка/8. Комірка - Купівля деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/11.1 Комірка - Майнові - розстрочка.docx",
    "Через КУА/Юридична особа/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
    "Через КУА/Юридична особа/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Юридична особа/А - Квартира/7. Квартира - Форвадний контракт.docx",
    "Через КУА/Юридична особа/А - Квартира/8. Квартира - Купівля деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/11.1 Квартира - Майнові права - розстрочка.docx",
    "Через КУА/Юридична особа/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
    "Через КУА/Юридична особа/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  array(
   "Через КУА/Юридична особа/С - Комерція/7. Комерція - Форвадний контракт.docx",
   "Через КУА/Юридична особа/С - Комерція/8. Комерція - Купівля деривативу.docx",
   "Через КУА/Юридична особа/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
   "Через КУА/Юридична особа/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
   "Через КУА/Юридична особа/С - Комерція/11.1 Комерція - Майнові - розстрочка.docx",
   "Через КУА/Юридична особа/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
   "Через КУА/Юридична особа/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
                                                         /*Фінальні документи/Через КУА/Фізична особа - ФОП/разова */
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(                                                       
    "Через КУА/Фізична особа - ФОП/P - Комірка/7. Комірка - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/8. Комірка - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Фізична особа - ФОП/А - Квартира/7. Квартира - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/8. Квартира - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Фізична особа - ФОП/С - Комерція/7. Комерція - Форвадний контракт.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/8. Комерція - Купівля деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
    "Через КУА/Фізична особа - ФОП/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
                                                        /*Фінальні документи/Через КУА/Юридична особа/разова */
  //---------------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Юридична особа/P - Комірка/7. Комірка - Форвадний контракт.docx",
    "Через КУА/Юридична особа/P - Комірка/8. Комірка - Купівля деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/9. Комірка - Акт передачі деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/10. Комірка - Пов про прийняття деривативу.docx",
    "Через КУА/Юридична особа/P - Комірка/11.2 Комірка - Майнові - разова оплата.docx",
    "Через КУА/Юридична особа/P - Комірка/12. Комірка - Платіжка за майнові (70%).docx",
    "Через КУА/Юридична особа/P - Комірка/13. Комірка - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Юридична особа/А - Квартира/7. Квартира - Форвадний контракт.docx",
    "Через КУА/Юридична особа/А - Квартира/8. Квартира - Купівля деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/9. Квартира - Акт передачі деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/10. Квартира - Пов про прийняття деривативу.docx",
    "Через КУА/Юридична особа/А - Квартира/11.2 Квартира - Майнові права - разова оплата.docx",
    "Через КУА/Юридична особа/А - Квартира/12. Квартира - Платіжка за майнові (70%).docx",
    "Через КУА/Юридична особа/А - Квартира/13. Квартира - Платіжка за форвард (30%).docx"
  ),
  //---------------------------------------------------------------------------------------------------------------------------------------------------
  array(
    "Через КУА/Юридична особа/С - Комерція/7. Комерція - Форвадний контракт.docx",
    "Через КУА/Юридична особа/С - Комерція/8. Комерція - Купівля деривативу.docx",
    "Через КУА/Юридична особа/С - Комерція/9. Комерція - Акт передачі деривативу.docx",
    "Через КУА/Юридична особа/С - Комерція/10. Комерція - Пов про прийняття деривативу.docx",
    "Через КУА/Юридична особа/С - Комерція/11.2 Комерція - Майнові - разова оплата.docx",
    "Через КУА/Юридична особа/С - Комерція/12. Комерція - Платіжка за майнові (70%).docx",
    "Через КУА/Юридична особа/С - Комерція/13. Комерція - Платіжка за форвард (30%).docx"
  )
);
?>